       IDENTIFICATION DIVISION.
      *
       PROGRAM-ID. hello.
      *PROGRAMMER. Somebody
       PROCEDURE DIVISION.
           DISPLAY "Hello".
           STOP RUN.
