       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
      * Some comment
       PROCEDURE DIVISION.
           DISPLAY "Hello".
           STOP RUN.
