        IDENTIFICATION DIVISION.
        Program-ID. Init.
      *  Author. Pawel.

        DATA DIVISION.
        WORKING-STORAGE SECTION.

        PROCEDURE DIVISION.

        PERFORM 100-TEST.

        100-TEST.
           DISPLAY "HELLO".

        STOP RUN.            